7767517
132 146
Input            input                    0 1 input
Convolution      355                      1 1 input 355 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=864
ReLU             357                      1 1 355 357
ConvolutionDepthWise 358                      1 1 357 358 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=288 7=32
ReLU             360                      1 1 358 360
Convolution      361                      1 1 360 361 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=512
Convolution      363                      1 1 361 363 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=1536
ReLU             365                      1 1 363 365
ConvolutionDepthWise 366                      1 1 365 366 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=864 7=96
ReLU             368                      1 1 366 368
Convolution      369                      1 1 368 369 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2304
Split            splitncnn_0              1 2 369 369_splitncnn_0 369_splitncnn_1
Convolution      371                      1 1 369_splitncnn_1 371 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3456
ReLU             373                      1 1 371 373
ConvolutionDepthWise 374                      1 1 373 374 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=1296 7=144
ReLU             376                      1 1 374 376
Convolution      377                      1 1 376 377 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3456
BinaryOp         379                      2 1 369_splitncnn_0 377 379 0=0
Convolution      380                      1 1 379 380 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=3456
ReLU             382                      1 1 380 382
ConvolutionDepthWise 383                      1 1 382 383 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=1296 7=144
ReLU             385                      1 1 383 385
Convolution      386                      1 1 385 386 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4608
Split            splitncnn_1              1 2 386 386_splitncnn_0 386_splitncnn_1
Convolution      388                      1 1 386_splitncnn_1 388 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6144
ReLU             390                      1 1 388 390
ConvolutionDepthWise 391                      1 1 390 391 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=1728 7=192
ReLU             393                      1 1 391 393
Convolution      394                      1 1 393 394 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6144
BinaryOp         396                      2 1 386_splitncnn_0 394 396 0=0
Split            splitncnn_2              1 2 396 396_splitncnn_0 396_splitncnn_1
Convolution      397                      1 1 396_splitncnn_1 397 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6144
ReLU             399                      1 1 397 399
ConvolutionDepthWise 400                      1 1 399 400 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=1728 7=192
ReLU             402                      1 1 400 402
Convolution      403                      1 1 402 403 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6144
BinaryOp         405                      2 1 396_splitncnn_0 403 405 0=0
Split            splitncnn_3              1 2 405 405_splitncnn_0 405_splitncnn_1
Convolution      406                      1 1 405_splitncnn_1 406 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6144
ReLU             408                      1 1 406 408
ConvolutionDepthWise 409                      1 1 408 409 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=1728 7=192
ReLU             411                      1 1 409 411
Convolution      412                      1 1 411 412 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=12288
Split            splitncnn_4              1 2 412 412_splitncnn_0 412_splitncnn_1
Convolution      414                      1 1 412_splitncnn_1 414 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
ReLU             416                      1 1 414 416
ConvolutionDepthWise 417                      1 1 416 417 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=3456 7=384
ReLU             419                      1 1 417 419
Convolution      420                      1 1 419 420 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
BinaryOp         422                      2 1 412_splitncnn_0 420 422 0=0
Split            splitncnn_5              1 2 422 422_splitncnn_0 422_splitncnn_1
Convolution      423                      1 1 422_splitncnn_1 423 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
ReLU             425                      1 1 423 425
ConvolutionDepthWise 426                      1 1 425 426 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=3456 7=384
ReLU             428                      1 1 426 428
Convolution      429                      1 1 428 429 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
BinaryOp         431                      2 1 422_splitncnn_0 429 431 0=0
Split            splitncnn_6              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution      432                      1 1 431_splitncnn_1 432 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
ReLU             434                      1 1 432 434
ConvolutionDepthWise 435                      1 1 434 435 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=3456 7=384
ReLU             437                      1 1 435 437
Convolution      438                      1 1 437 438 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
BinaryOp         440                      2 1 431_splitncnn_0 438 440 0=0
Convolution      441                      1 1 440 441 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=24576
ReLU             443                      1 1 441 443
ConvolutionDepthWise 444                      1 1 443 444 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=3456 7=384
ReLU             446                      1 1 444 446
Convolution      447                      1 1 446 447 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=36864
Split            splitncnn_7              1 2 447 447_splitncnn_0 447_splitncnn_1
Convolution      449                      1 1 447_splitncnn_1 449 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=55296
ReLU             451                      1 1 449 451
ConvolutionDepthWise 452                      1 1 451 452 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=5184 7=576
ReLU             454                      1 1 452 454
Convolution      455                      1 1 454 455 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=55296
BinaryOp         457                      2 1 447_splitncnn_0 455 457 0=0
Split            splitncnn_8              1 2 457 457_splitncnn_0 457_splitncnn_1
Convolution      458                      1 1 457_splitncnn_1 458 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=55296
ReLU             460                      1 1 458 460
ConvolutionDepthWise 461                      1 1 460 461 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=5184 7=576
ReLU             463                      1 1 461 463
Convolution      464                      1 1 463 464 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=55296
BinaryOp         466                      2 1 457_splitncnn_0 464 466 0=0
Split            splitncnn_9              1 2 466 466_splitncnn_0 466_splitncnn_1
Convolution      467                      1 1 466_splitncnn_1 467 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=55296
ReLU             469                      1 1 467 469
ConvolutionDepthWise 470                      1 1 469 470 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=1 6=5184 7=576
ReLU             472                      1 1 470 472
Convolution      473                      1 1 472 473 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=92160
Split            splitncnn_10             1 2 473 473_splitncnn_0 473_splitncnn_1
Convolution      475                      1 1 473_splitncnn_1 475 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=153600
ReLU             477                      1 1 475 477
ConvolutionDepthWise 478                      1 1 477 478 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=8640 7=960
ReLU             480                      1 1 478 480
Convolution      481                      1 1 480 481 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=153600
BinaryOp         483                      2 1 473_splitncnn_0 481 483 0=0
Split            splitncnn_11             1 2 483 483_splitncnn_0 483_splitncnn_1
Convolution      484                      1 1 483_splitncnn_1 484 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=153600
ReLU             486                      1 1 484 486
ConvolutionDepthWise 487                      1 1 486 487 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=8640 7=960
ReLU             489                      1 1 487 489
Convolution      490                      1 1 489 490 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=153600
BinaryOp         492                      2 1 483_splitncnn_0 490 492 0=0
Convolution      493                      1 1 492 493 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=153600
ReLU             495                      1 1 493 495
ConvolutionDepthWise 496                      1 1 495 496 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=8640 7=960
ReLU             498                      1 1 496 498
Convolution      499                      1 1 498 499 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=307200
Convolution      501                      1 1 499 501 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=40960
ReLU             503                      1 1 501 503
DeconvolutionDepthWise 504                      1 1 503 504 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=512 7=128
BatchNorm        505                      1 1 504 505 0=128
ReLU             506                      1 1 505 506
Convolution      507                      1 1 466_splitncnn_0 507 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=12288
ReLU             509                      1 1 507 509
BinaryOp         510                      2 1 506 509 510 0=0
DeconvolutionDepthWise 511                      1 1 510 511 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=512 7=128
BatchNorm        512                      1 1 511 512 0=128
ReLU             513                      1 1 512 513
Convolution      514                      1 1 405_splitncnn_0 514 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=4096
ReLU             516                      1 1 514 516
BinaryOp         517                      2 1 513 516 517 0=0
DeconvolutionDepthWise 518                      1 1 517 518 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 5=0 6=512 7=128
BatchNorm        519                      1 1 518 519 0=128
ReLU             520                      1 1 519 520
Convolution      521                      1 1 520 521 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=1 6=147456
ReLU             523                      1 1 521 523
Split            splitncnn_12             1 3 523 523_splitncnn_0 523_splitncnn_1 523_splitncnn_2
Convolution      524                      1 1 523_splitncnn_2 524 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2560
Sigmoid          hm                       1 1 524 hm
Convolution      wh                       1 1 523_splitncnn_1 wh 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=256
Convolution      reg                      1 1 523_splitncnn_0 reg 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=256
